Revit 2024 API
FabricationPart.SetDimensionValue Method
 Sets the fabrication dimension value. The value is in Revit internal units.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public void SetDimensionValue(
	FabricationDimensionDefinition dim,
	double newValue
)
Visual Basic
Public Sub SetDimensionValue ( _
	dim As FabricationDimensionDefinition, _
	newValue As Double _
)
Visual C++
public:
void SetDimensionValue(
	FabricationDimensionDefinition^ dim,
	double newValue
)
Parameters
dim
Type: Autodesk.Revit.DB.FabricationDimensionDefinition
 The fabrication dimension.
newValue
Type: System.Double
 The dimension value.
Remarks
 Multiple dimensions may need to be set in order to reach the desired outcome. The document must be regenerated before the fabrication part can be used. Check ValidationStatus after regeneration to see if the part is valid for fabrication.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  fabrication dimension is unable to be modified because it is locked or from a product list. -or- the fabrication dimension is unable to be modified because it will affect the geometry of a connected end.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  the fabrication dimension is unable to be modified because the fabrication part is connected to more than one object. -or- the fabrication dimension cannot be set to the value: newValue.
See Also
FabricationPart Class
Autodesk.Revit.DB Namespace